### Terraform Plan (dev)
```
module.ecs.data.aws_region.current: Reading...
module.iam.data.aws_iam_policy_document.ecs_assume_role: Reading...
module.iam.data.aws_caller_identity.current: Reading...
module.vpc.data.aws_region.current: Reading...
module.iam.aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::641288786609:oidc-provider/token.actions.githubusercontent.com]
module.secrets.aws_secretsmanager_secret.this: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:641288786609:secret:stellanova/dev/app-secrets-55CMZ2]
module.rds.aws_db_parameter_group.this: Refreshing state... [id=stellanova-dev-pg16]
module.ecs.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:us-east-1:641288786609:cluster/stellanova-dev]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-0a9be89ce9fa89031]
module.ecs.aws_cloudwatch_log_group.this: Refreshing state... [id=/ecs/stellanova-dev]
module.iam.data.aws_iam_policy_document.ecs_assume_role: Read complete after 0s [id=1077804475]
module.ecs.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.iam.data.aws_region.current: Reading...
module.ecr.aws_ecr_repository.this: Refreshing state... [id=stellanova-dev]
module.iam.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.iam.aws_iam_role.ecs_task: Refreshing state... [id=stellanova-dev-ecs-task]
module.iam.aws_iam_role.ecs_task_execution: Refreshing state... [id=stellanova-dev-ecs-task-execution]
module.iam.data.aws_caller_identity.current: Read complete after 0s [id=641288786609]
module.secrets.aws_secretsmanager_secret_version.this: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:641288786609:secret:stellanova/dev/app-secrets-55CMZ2|terraform-20260222003110256700000002]
module.iam.data.aws_iam_policy_document.github_actions_assume_role: Reading...
module.iam.data.aws_iam_policy_document.github_actions_assume_role: Read complete after 0s [id=256402973]
module.iam.aws_iam_role.github_actions: Refreshing state... [id=stellanova-dev-github-actions]
module.ecr.aws_ecr_lifecycle_policy.this: Refreshing state... [id=stellanova-dev]
module.iam.aws_iam_role_policy.ecs_task_execution_secrets: Refreshing state... [id=stellanova-dev-ecs-task-execution:stellanova-dev-execution-secrets]
module.iam.aws_iam_role_policy_attachment.ecs_task_execution_managed: Refreshing state... [id=stellanova-dev-ecs-task-execution-20260222003110619900000003]
module.iam.aws_iam_role_policy.ecs_task_execution_logs: Refreshing state... [id=stellanova-dev-ecs-task-execution:stellanova-dev-execution-logs]
module.iam.aws_iam_role_policy.ecs_task_cognito: Refreshing state... [id=stellanova-dev-ecs-task:stellanova-dev-task-cognito]
module.iam.aws_iam_role_policy.ecs_task_iot: Refreshing state... [id=stellanova-dev-ecs-task:stellanova-dev-task-iot]
module.iam.aws_iam_role_policy.ecs_task_sqs: Refreshing state... [id=stellanova-dev-ecs-task:stellanova-dev-task-sqs]
module.iam.aws_iam_role_policy.github_actions_ecs: Refreshing state... [id=stellanova-dev-github-actions:stellanova-dev-gha-ecs]
module.iam.aws_iam_role_policy.github_actions_ecr: Refreshing state... [id=stellanova-dev-github-actions:stellanova-dev-gha-ecr]
module.iam.aws_iam_role_policy.github_actions_terraform_state: Refreshing state... [id=stellanova-dev-github-actions:stellanova-dev-gha-tfstate]
module.iam.aws_iam_role_policy.github_actions_terraform: Refreshing state... [id=stellanova-dev-github-actions:stellanova-dev-gha-terraform]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-052632b6bdd90516b]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-056d650a72def1f37]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-09d85f8c8aa209825]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0027de8388b3edb83]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0f2383ecf8dedaa98]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0ed7c84555e0d6dad]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-0f0a1ce43d9b15a22]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-08b655e6dfcb396ca]
module.vpc.aws_route_table.database: Refreshing state... [id=rtb-0bf64a69475e77549]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b7d02135139ad6bf]
module.alb.aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:641288786609:targetgroup/stellanova-dev-tg/b2943306d5af6804]
module.alb.aws_security_group.alb: Refreshing state... [id=sg-0a1f56f89ba893539]
module.rds.aws_security_group.this: Refreshing state... [id=sg-09d080ae1791ead04]
module.ecs.aws_security_group.ecs_tasks: Refreshing state... [id=sg-0767173552b55a9cf]
module.vpc.aws_route.public_internet: Refreshing state... [id=r-rtb-0f2383ecf8dedaa981080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-01a825b1d19d6c968]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-000bcbbcc1c8057ca]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0bc2cc650a66c9bc8]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09a18d5d103ac846e]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0ea5d5783001ff797]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-099fdf06819e6f710]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-01325d5813bface8e]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:641288786609:loadbalancer/app/stellanova-dev-alb/6353fa3ad1af32c8]
module.rds.aws_security_group_rule.all_egress: Refreshing state... [id=sgrule-1304198226]
module.rds.aws_security_group_rule.postgres_ingress["10.0.48.0/20"]: Refreshing state... [id=sgrule-3689217571]
module.rds.aws_security_group_rule.postgres_ingress["10.0.32.0/20"]: Refreshing state... [id=sgrule-1968285812]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=stellanova-dev]
module.ecs.aws_security_group_rule.all_egress: Refreshing state... [id=sgrule-6002331]
module.ecs.aws_security_group_rule.alb_ingress: Refreshing state... [id=sgrule-3061196935]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-00ef329f2d294ef44]
module.alb.aws_lb_listener.http_forward[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:641288786609:listener/app/stellanova-dev-alb/6353fa3ad1af32c8/196fdc81aca962db]
module.vpc.aws_route.private_nat[0]: Refreshing state... [id=r-rtb-056d650a72def1f371080289494]
module.rds.aws_db_instance.this: Refreshing state... [id=db-6ZGOANZG7H24UNX7EP74LQGH4Y]
module.ecs.aws_ecs_task_definition.this: Refreshing state... [id=stellanova-dev]
module.ecs.aws_ecs_service.this: Refreshing state... [id=arn:aws:ecs:us-east-1:641288786609:service/stellanova-dev/stellanova-dev-service]
module.ecs.aws_appautoscaling_target.this: Refreshing state... [id=service/stellanova-dev/stellanova-dev-service]
module.ecs.aws_appautoscaling_policy.cpu: Refreshing state... [id=stellanova-dev-cpu-autoscaling]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.rds.aws_db_instance.this will be updated in-place
  ~ resource "aws_db_instance" "this" {
        id                                    = "db-6ZGOANZG7H24UNX7EP74LQGH4Y"
      ~ password                              = (sensitive value)
        tags                                  = {
            "Environment" = "dev"
            "Name"        = "stellanova-dev-rds"
            "Project"     = "stellanova"
        }
        # (56 unchanged attributes hidden)
    }

  # module.secrets.aws_secretsmanager_secret_version.this must be replaced
-/+ resource "aws_secretsmanager_secret_version" "this" {
      ~ arn                  = "arn:aws:secretsmanager:us-east-1:641288786609:secret:stellanova/dev/app-secrets-55CMZ2" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:us-east-1:641288786609:secret:stellanova/dev/app-secrets-55CMZ2|terraform-20260222003110256700000002" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20260222003110256700000002" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```